leetcode_2452_words_within_two_edits_of_dictionary.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 2452. Words Within Two Edits of Dictionary</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Leetcode: 2452. Words Within Two Edits of Dictionary</h1>

<div id="outline-container-org8584e06" class="outline-2">
<h2 id="org8584e06">Understand the problem</h2>
<div class="outline-text-2" id="text-org8584e06">
<p>
Given a dictionary and queries, return a subarray of queries which each query \(q\) appear in the dictionary if edit distance (only change) at most 2.
</p>
</div>
</div>

<div id="outline-container-org1334491" class="outline-2">
<h2 id="org1334491">Devise a plan</h2>
<div class="outline-text-2" id="text-org1334491">
<p>
<a href="pattern_small_constraints_could_allow_brute_force_solution.html#ID-BC81A358-FBCC-43AA-9928-E9778A107869">Pattern: Small constraints could allow a brute-force solution</a>.  For each query, compute the edit distance to all words in the dictionary and add it to the output if the distance is at most 2.
</p>
</div>

<div id="outline-container-orgf01e114" class="outline-3">
<h3 id="orgf01e114">Carry out the plan</h3>
<div class="outline-text-3" id="text-orgf01e114">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">twoEditWords</span>(<span style="font-weight: bold;">self</span>, queries: List[<span style="font-weight: bold;">str</span>], dictionary: List[<span style="font-weight: bold;">str</span>]) -&gt; List[<span style="font-weight: bold;">str</span>]:
        <span style="font-weight: bold;">return</span> [
            q
            <span style="font-weight: bold;">for</span> q <span style="font-weight: bold;">in</span> queries
            <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">any</span>(<span style="font-weight: bold;">sum</span>(a != b <span style="font-weight: bold;">for</span> a, b <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">zip</span>(q, d)) &lt;= 2 <span style="font-weight: bold;">for</span> d <span style="font-weight: bold;">in</span> dictionary)
        ]
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>